SOAP UI/01_Calculator_Demo_SOAP Project/TestSuite4__Property_Transfer_Demo-Calculator_TestCase-Add-0-FAILED.txt

Status: FAILED
Time Taken: 58979
Size: 0
Timestamp: Thu May 04 11:22:40 IST 2023
TestStep: Add

----------------- Messages ------------------------------
java.net.SocketException: Connection reset

----------------- Properties ------------------------------
Endpoint: http://www.dneonline.com/calculator.asmx
Encoding: UTF-8

---------------- Request ---------------------------
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Add>
         <tem:intA>500</tem:intA>
         <tem:intB>250</tem:intB>
      </tem:Add>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
- missing response / garbage collected -
